/**
 * 游戏背景介绍
 */
Crafty.story('background',[
	{
		text: '时光流逝 勇士和公主的传说总是被人津津乐道 坚强的勇士 锋利的宝剑 美丽的公主 这些传说延绵了几个世纪仍然风靡一时 现在我们要讲述的就是一个发生在艾泽洛斯大陆的故事 一个美丽的传说 他的开头或许有那么一点不同 过程或许有一点荒诞 但结局仍算完美...嗯 大概吧 ',
		bg: 'storyBg1'
	},
	{
		text: '故事发生在大陆的南部 温暖的凯撒斯平原 在今年头个月圆的晚上 吉斯特公国的邻邦维纶帝国的国王对吉斯特公国发动了突然袭击 闪电作战下 吉斯特的王城瞬间被攻陷 老国王被残忍的杀害 只有公主夏尔蒂跑了出来 年轻的王女在吉斯特皇家骑士团的保护下杀出重围 向着临近的中立国盖迪尔联邦前进 想要寻求帮助',
		bg: 'storyBg2'
	},
	{
	    text: '男孩的名字叫安东 隶属于盖迪尔联邦有名的佣兵团“疾风之狼”的他是因为父亲的原因而“靠关系”进的佣兵团的 他一直想证明自己的能力 但是事与愿违 每次都帮了倒忙 这一天又一次独立任务失败的他 不想看到同伴们嘲讽的嘴脸 来到城外散心 正好遇到了被维纶骑士追杀的公主 于是我们的故事开始了...',
		bg: 'storyBg3'
	}
]);

Crafty.story('toBeContinue', [
	{
	    text: '勇士与公主的第一次见面 公主的美丽和坚强的斗志锋利的宝剑都给勇士印下了深刻的印象 额 好像哪里不对劲...不管了...总之少女是向着复国的路上迈出了坚实的一步 而男孩的英雄救美的路线似乎也在继续 之后会发生什么呢？',
	    bg: 'storyBg1'
	}	
]);